<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"051bcdea5e4a2adebaf374444927c6e27c5b2bf365ef199b6509e5c9282bf7ab","plan_job_ref":"Job Plan Airflow DAGs #243 at https://github.com/cal-itp/data-infra/actions/runs/16209349208","plan_out_hash":"487a3d8035cdd89efed4f9a0e4a2440955597983a680b1f8d34149ddf0f65f6f","plan_hash":"8fd2dc69acbe3798d086e15d2dda6a8d3a9b3760136665e9b1b286deb3f878d7","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "0MvR1A==" -> (known after apply)
!~      detect_md5hash      = "ywugIlUZagDiCHTvCgCd/A==" -> "different hash"
!~      generation          = 1752188818639284 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "ywugIlUZagDiCHTvCgCd/A==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "5rnSGw==" -> (known after apply)
!~      detect_md5hash      = "S7QmrKUvBe0feksd/+70Ww==" -> "different hash"
!~      generation          = 1752188820132103 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "S7QmrKUvBe0feksd/+70Ww==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "KvxdLg==" -> (known after apply)
!~      detect_md5hash      = "kh10Bt2VtvG+0yNnA5q1/Q==" -> "different hash"
!~      generation          = 1752103419390838 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "kh10Bt2VtvG+0yNnA5q1/Q==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #243](https://github.com/cal-itp/data-infra/actions/runs/16209349208)